// src/data/patents.ts

export type Patent = {
  id: string;
  year?: number;
  title: string;
  number?: string;
  inventors?: string;
};

export const patents: Patent[] = [
  {
    id: "pat-01",
    year: 2024,
    title: "王天志，周懿. 一种微纳米气泡发生器，专利号：CN222312350U",
    number: "CN222312350U",
  },
  {
    id: "pat-02",
    year: 2024,
    title: "周懿，王天志. 一种二次供水水箱水质改善设备，专利号：CN222312351U",
    number: "CN222312351U",
  },
  {
    id: "pat-03",
    year: 2024,
    title: "王天志，张啸岩. 一种可调节微纳米气泡发生器，专利号：CN222312352U",
    number: "CN222312352U",
  },
  {
    id: "pat-04",
    year: 2024,
    title: "王天志，吴睿. 一种臭氧纳米气泡水箱，专利号：CN222312353U",
    number: "CN222312353U",
  },
  {
    id: "pat-05",
    year: 2024,
    title: "黄俊，薛镒贤，王天志，等. 一种用于设施农业地下供水系统的滴灌带冲洗装置及方法，专利号：202410698770.X",
    number: "202410698770.X",
  },
  {
    id: "pat-06",
    year: 2024,
    title: "王天志，吴睿. 一种臭氧纳米气泡发生器，专利号：CN 119044590 A",
    number: "CN119044590A",
  },
  {
    id: "pat-07",
    year: 2024,
    title: "王天志，吴睿. 一种臭氧纳米气泡系统及臭氧纳米气泡水的产生方法，专利号：CN 119044589 A",
    number: "CN119044589A",
  },
  {
    id: "pat-08",
    year: 2024,
    title: "王天志，吴睿. 一种用于臭氧纳米气泡的曝气装置，专利号：CN 119044588 A",
    number: "CN119044588A",
  },
  {
    id: "pat-09",
    year: 2023,
    title: "王天志，吴睿. 一种油田污水处理装置及处理方法，专利号：CN 116986754 A",
    number: "CN116986754A",
  },
  {
    id: "pat-10",
    year: 2023,
    title: "王天志，吴睿. 一种三相流态微纳米气泡发生器，专利号：CN 116986775 A",
    number: "CN116986775A",
  },
  {
    id: "pat-11",
    year: 2023,
    title: "王天志，吴睿. 一种臭氧纳米气泡水处理系统，专利号：ZL 202321738756.7",
    number: "ZL202321738756.7",
  },
  {
    id: "pat-12",
    year: 2023,
    title: "王天志，吴睿. 一种臭氧纳米气泡发生器，专利号：ZL 202321709114.0",
    number: "ZL202321709114.0",
  },
  {
    id: "pat-13",
    year: 2023,
    title: "王天志，吴睿. 一种三相流态微纳米气泡发生器，专利号：ZL 202321448031.9",
    number: "ZL202321448031.9",
  },
  {
    id: "pat-14",
    year: 2023,
    title: "何倩，金超，王天志，等. 一种基于粪便资源化的菌剂，专利号：CN 116286555 A",
    number: "CN116286555A",
  },
  {
    id: "pat-15",
    year: 2023,
    title: "黄俊，薛镒贤，冯牧华，王天志，等. 一种农业废弃物破碎机，专利号：CN219765445U",
    number: "CN219765445U",
  },
  {
    id: "pat-16",
    year: 2023,
    title: "黄俊，李志杰，周郁芊，薛镒贤，王天志，等. 一种蔬菜种植育苗箱，专利号：CN219812669U",
    number: "CN219812669U",
  },
  {
    id: "pat-17",
    year: 2019,
    title: "胡洪营，王天志，巫寅虎. 一种废水生物处理特性评价方法. 专利号：201911132489.7",
    number: "201911132489.7",
  },
  {
    id: "pat-18",
    year: 2018,
    title: "郭祖诚，王天志，等. 垃圾焚烧发电热电联产与水热液化协同处置城市生活垃圾的方法. 专利号：CN 109099435 A",
    number: "CN109099435A",
  },
  {
    id: "pat-19",
    year: 2014,
    title: "李云开，王克远，王天志，张志静. 利用微生物拮抗作用清除滴灌系统灌水器堵塞的方法. 专利号：ZL 201410019340.9",
    number: "ZL201410019340.9",
  },
  {
    id: "pat-20",
    year: 2014,
    title: "李云开，王天志，冯吉，裴旖婷. 滴灌系统管壁附生生物膜培养装置及其使用方法. 专利号：ZL201410076970.x",
    number: "ZL201410076970.x",
  },
  {
    id: "pat-21",
    year: 2014,
    title: "李云开，周博，王天志，吴乃阳. 滴灌灌水器附生生物膜模拟培养装置及其应用. 专利号：ZL201410105514.3",
    number: "ZL201410105514.3",
  },
  {
    id: "pat-22",
    year: 2015,
    title: "李云开，王伟楠，王天志，冯吉. 滴灌系统灌水器内部堵塞物质分布的原位测试与评价方法. 专利号：ZL201510224934.8",
    number: "ZL201510224934.8",
  },
];

export default patents;
