export type ProjectItem = {
  name: string;
  start?: string;
  end?: string;
};

export type ProjectSection = {
  title: string;
  items: ProjectItem[];
};

export const projectSections: ProjectSection[] = [
  {
    title: "自主基金",
    items: [
      {
        name: "纳米级可控与多气源转换的微纳米气泡发生器设计研发",
        start: "2025-06-01",
        end: "2025-12-15",
      },
      {
        name: "微纳米气泡水中・OH 原位生成及其对生物膜控制机制",
        start: "2024-01-01",
        end: "2025-12-31",
      },
      {
        name: "微纳米气泡湮灭生成羟基自由基的机制研究",
        start: "2023-01-01",
        end: "2023-12-31",
      },
      {
        name: "加氧滴灌对海南大棚西瓜增产提质的机制研究",
        start: "2022-01-01",
        end: "2022-12-31",
      },
    ],
  },
  {
    title: "项目列表",
    items: [
      {
        name: "天津城市防洪排涝情景下水环境风险及水生态安全管控关键技术研发与示范-多气源在线切换微纳米曝气系统设备研发与应用(环境学院)",
        start: "2025-09-01",
        end: "2029-08-31",
      },
      {
        name: "微纳米气泡发生过程中机械切割与压力剪切共强化结构设计(环境学院)",
        start: "2025-05-26",
        end: "2027-07-31",
      },
      {
        name: "天津市关闭搬迁企业优先监管地块重点监测项目地下管线探测方案编制(环境学院)",
        start: "2024-12-05",
        end: "2025-06-30",
      },
      {
        name: "油泥沙纳米气泡破乳及强化石油烃脱除机制研究(环境学院)",
        start: "2024-11-26",
        end: "2025-12-31",
      },
      {
        name: "微纳米气泡对大肠杆菌的消杀实验研究(环境学院)",
        start: "2024-11-05",
        end: "2025-12-31",
      },
      {
        name: "土壤调理剂对土壤污染物的控制效果及其技术规范研究(环境学院)",
        start: "2024-03-25",
        end: "2024-12-31",
      },
      {
        name: "BOD在线监测设备研发(环境学院)",
        start: "2024-01-01",
        end: "2025-12-31",
      },
      {
        name: "污水处理工艺智能决策控制模型开发(环境学院)",
        start: "2023-12-01",
        end: "2025-05-31",
      },
      {
        name: "微纳米气泡技术在二供系统中的应用研究(环境学院)",
        start: "2023-08-01",
        end: "2024-12-31",
      },
      {
        name: "石家庄市桥西区工业废水污染源监测及治理系统构建(环境学院)",
        start: "2022-01-01",
        end: "2023-08-31",
      },
      {
        name: "宕昌县农业施肥对小流域水体污染的影响及施肥量控制阈值研究",
      },
      {
        name: "天津城市防洪排涝情景下水环境风险及水生态安全管控关键技术研发与示范-多气源在线切换微纳米曝气系统设备研发与应用",
        start: "2025-09",
        end: "2029-08",
      },
    ],
  },
];

export default projectSections;
