export type ProjectItem = {
  name: string;
  start?: string;
  end?: string;
};

export type ProjectSection = {
  title: string;
  items: ProjectItem[];
};

export const projectSections: ProjectSection[] = [
  {
    title: "自主基金",
    items: [
      {
        name: "纳米级可控与多气源转换的微纳米气泡发生器设计研发",
        start: "2025-06-01",
        end: "2025-12-15",
      },
      {
        name: "微纳米气泡水中・OH 原位生成及其对生物膜控制机制",
        start: "2024-01-01",
        end: "2025-12-31",
      },
      {
        name: "微纳米气泡湮灭生成羟基自由基的机制研究",
        start: "2023-01-01",
        end: "2023-12-31",
      },
      {
        name: "加氧滴灌对海南大棚西瓜增产提质的机制研究",
        start: "2022-01-01",
        end: "2022-12-31",
      },
    ],
  },
  {
    title: "项目列表",
    items: [
      {
        name: "京津冀环境综合治理国家科技重大专项（2026ZD1208903-01）— 京津冀农村季节性黑臭水体治理关键技术装备与应用示范-水体致黑臭固体有机废弃物快速上浮与高效低耗收集装备",
        start: "2026-06-01",
        end: "2030-05-31",
      },
      {
        name: "京津冀环境综合治理国家科技重大专项（2026ZD1208904-03）— 京津冀农村季节性黑臭水体治理关键技术装备与应用示范-粒径自适应微纳米气泡的泥/水界面生境原位改善技术",
        start: "2026-06-01",
        end: "2030-05-31",
      },
      {
        name: "京津冀环境综合治理国家科技重大专项（2026ZD1208905-05）— 京津冀农村季节性黑臭水体治理关键技术装备与应用示范-内源释放型黑臭水体原位修复技术集成及示范",
        start: "2026-06-01",
        end: "2030-05-31",
      },
      {
        name: "京津冀环境综合治理国家科技重大专项（2026ZD1208905-07）— 京津冀农村季节性黑臭水体治理关键技术装备与应用示范-复合污染型黑臭水体综合治理技术集成与示范",
        start: "2026-06-01",
        end: "2030-05-31",
      },
      {
        name: "天津城市防洪排涝情景下水环境风险及水生态安全管控关键技术研发与示范-多气源在线切换微纳米曝气系统设备研发与应用",
        start: "2025-09-01",
        end: "2029-08-31",
      },
      {
        name: "微纳米气泡发生过程中机械切割与压力剪切共强化结构设计",
        start: "2025-05-26",
        end: "2027-07-31",
      },
      {
        name: "天津市关闭搬迁企业优先监管地块重点监测项目地下管线探测方案编制",
        start: "2024-12-05",
        end: "2025-06-30",
      },
      {
        name: "油泥沙纳米气泡破乳及强化石油烃脱除机制研究",
        start: "2024-11-26",
        end: "2025-12-31",
      },
      {
        name: "微纳米气泡对大肠杆菌的消杀实验研究",
        start: "2024-11-05",
        end: "2025-12-31",
      },
      {
        name: "土壤调理剂对土壤污染物的控制效果及其技术规范研究",
        start: "2024-03-25",
        end: "2024-12-31",
      },
      {
        name: "BOD在线监测设备研发",
        start: "2024-01-01",
        end: "2025-12-31",
      },
      {
        name: "污水处理工艺智能决策控制模型开发",
        start: "2023-12-01",
        end: "2025-05-31",
      },
      {
        name: "微纳米气泡技术在二供系统中的应用研究",
        start: "2023-08-01",
        end: "2024-12-31",
      },
      {
        name: "石家庄市桥西区工业废水污染源监测及治理系统构建",
        start: "2022-01-01",
        end: "2023-08-31",
      },
      {
        name: "宕昌县农业施肥对小流域水体污染的影响及施肥量控制阈值研究",
        start: "2021-01-01",
        end: "2021-12-31",
      },
    ],
  },
];

export default projectSections;
